[
  {
    "name": "Nick Ferggz",
    "avatar": "/images/founders/nick-ferggz.jpg",
    "description": "Nick has been a crypto enthusiast since 2014 and has an Asset Management/Finance background. He has experience advising top executives at companies such as Amazon, Microsoft & Adobe and has assisted in the deployment and management of over $300m in investment capital. Nick has been incredibility passionate about NFTs & Web 3.0 since joining the space in November 2021. He plans to parlay his success in the business world into success for our team and community in Web 3.0. When not working on Phunky Fungi you can catch him fishing, skateboarding or surfing."
  },
  {
    "name": "John Steez",
    "avatar": "/images/founders/john-steez.jpg",
    "description": "John has been in marketing and sales for 15 years with a background in design. He has experience working with some of the top companies in their industry such as Vans, Bank of America, USAA and Coldwell Banker. He has developed go to market strategies on all performance marketing channels including revenue growth. John has been in crypto since 2018 and in Web 3.0 since March 2021. When not working on Phunky Fungi John enjoys attending fashion shows, shooting photography at car meets and hiking with his dogs."
  },
  {
    "name": "Brennan Flower",
    "avatar": "/images/founders/brennan-flower.jpg",
    "description": "Brennan has been involved with Crypto since 2015 and recently began his journey in NFTs early 2021 seeing the back end of NFT projects. He solely runs a psychedelic clothing brand by the name of Disrupting Nirvana. In its first year Disrupting Nirvana surpassed 6 figures in sales, and in the following two years since has worked with major celebrities from the music and sports industries. Outside of the web Brennan enjoys a nice day full of yoga, meditation, foraging, crystal hunting, hiking and good vegan food."
  },
  {
    "name": "Joe Phreshh",
    "avatar": "/images/founders/joe-phreshh.jpg",
    "description": "Based out of New York City, Joe has been working in investment banking for 3 years. In this space, he has completed several transactions totaling over $500m. He is looking to take his financial background and apply it to Web3 in its early stage. Joe first bought XRP in 2017 and thought he would be a billionaire by now (until it was deemed not a security lol). He has always had a passion for art and music and is excited to be a partner in a research-oriented project with several layers of utility."
  },
  {
    "name": "Ryan Cwynar",
    "avatar": "/images/founders/ryan-cwynar.jpg",
    "description": "Based in Tallahasse, Ryan is a former Air Force Physicist turned software engineer and CTO. He believes that blockchain tools turn governmental design into an experimental science which will eventually allow large groups of people to balance their interests quickly, fairly, and cost effectively. He bought his first ETH and BTC in 2016 before the 2017 bull run and has been an advocate and participant in the space ever since."
  }
]